Центр_управления_производительностью_демо/src/Catalogs/Сценарии/Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сценарии</name>
  <predefined>
    <items>
      <name>Базовый</name>
      <description>Базовый</description>
    </items>
    <items>
      <name>Мониторинг</name>
      <description>Мониторинг</description>
    </items>
    <items>
      <name>Просмотр</name>
      <description>Просмотр</description>
    </items>
  </predefined>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеСостояние</name>
    <comment>Начальное состояние</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Структура</name>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СледующееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыСобытия</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыКоманды</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/CommonModules/СценарийВызовСервера/Module.bsl
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьСтруктуруСценария(Сценарий) Экспорт
	
	СтруктураСценария = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СценарийСтруктура.ТекущееСостояние КАК ТекущееСостояние,
	               |	СценарийСтруктура.СледующееСостояние КАК СледующееСостояние,
	               |	СценарийСтруктура.Событие КАК Событие,
	               |	СценарийСтруктура.ПараметрыСобытия КАК ПараметрыСобытия,
	               |	СценарийСтруктура.Команда КАК Команда,
	               |	СценарийСтруктура.ПараметрыКоманды КАК ПараметрыКоманды
	               |ИЗ
	               |	Справочник.Сценарии.Структура КАК СценарийСтруктура
	               |ГДЕ
	               |	СценарийСтруктура.Ссылка = &Сценарий";
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСтруктуры = ПолучитьШаблонСтруктурыСценария();
		ЗаполнитьЗначенияСвойств(СтрокаСтруктуры, Выборка);
		СтруктураСценария.Добавить(СтрокаСтруктуры);
	КонецЦикла;
	
	Возврат СтруктураСценария;
	
КонецФункции // ПолучитьСтруктуруСценария()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьШаблонСтруктурыСценария() Экспорт
	
	ШаблонСтруктуры = Новый Структура;
	ШаблонСтруктуры.Вставить("Строки", Новый Массив);
	ШаблонСтруктуры.Вставить("СтруктураСценария");
	ШаблонСтруктуры.Вставить("ТекущееСостояние");
	ШаблонСтруктуры.Вставить("Событие");
	ШаблонСтруктуры.Вставить("ПараметрыСобытия");
	ШаблонСтруктуры.Вставить("Команда");
	ШаблонСтруктуры.Вставить("ПараметрыКоманды");
	ШаблонСтруктуры.Вставить("СледующееСостояние");
	
	Возврат ШаблонСтруктуры;
	
КонецФункции // ПолучитьШаблонСтруктурыСценария()


///////////////////////////////////////////////////////////////////////////////
// ИМПОРТ / ЭКСПОРТ СЦЕНАРИЯ

// Импорт сценария
//
// Параметры:
//  ТекстСценария - Строка, XML представление сценария
//  Ссылка - СправочникСсылка, ссылка на объект в который импортировать данные
//
// Возвращаемое значение:
//  СправочникСсылка.Сценарий - ссылка на импортированный сценарий
//
Функция ИмпортСценария(ТекстСценария, Ссылка = Неопределено) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСценария);
	СценарийОбъект = ПрочитатьXML(ЧтениеXML);
	
	Если Ссылка = Неопределено Тогда
		СценарийОбъект = СценарийОбъект.Скопировать();
		СценарийОбъект.УстановитьНовыйКод();
		НовыйИдентификатор = Новый УникальныйИдентификатор;
		НоваяСсылка = Справочники.Сценарии.ПолучитьСсылку(НовыйИдентификатор);
		СценарийОбъект.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	СценарийОбъект.Записать();
	Возврат СценарийОбъект.Ссылка;
	
КонецФункции // ИмпортСценария()

// Экспорт сценария
//
// Параметры:
//  СценарийСсылка - ссылка на экспортируемый сценарий
//
// Возвращаемое значение:
//  Строка - XML представление экспортированного сценария
//
Функция ЭкспортСценария(СценарийСсылка) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, СценарийСсылка.ПолучитьОбъект());
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции // ЭкспортСценария()
